# DeactivateAllModes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryViewModes..::..DeactivateAllModes Method
TemporaryViewModes Class See Also
---
Deactivates all temporary modes that are currently active.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public void DeactivateAllModes()
```

Visual Basic
---
```text
Public Sub DeactivateAllModes
```

Visual C++
---
```text
public:
void DeactivateAllModes()
```

# See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace